docs: update UML Diagram
